In [2]:
import sqlite3
import pandas as pd
conn = sqlite3.connect("internship.db")
cursor = conn.cursor()

In [3]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS interns (
    id INTEGER PRIMARY KEY,
    name TEXT,
    track TEXT,
    stipend INTEGER
)
""")

conn.commit()

In [4]:
intern_data = [
    (1, "Aisha", "Data Science", 7000),
    (2, "Rahul", "Web Dev", 5000),
    (3, "Sneha", "Data Science", 6000),
    (4, "Arjun", "Web Dev", 4500),
    (5, "Meera", "Data Science", 8000)
]

cursor.executemany("INSERT OR REPLACE INTO interns VALUES (?, ?, ?, ?)", intern_data)
conn.commit()

In [5]:
query_filter = """
SELECT *
FROM interns
WHERE track = 'Data Science'
AND stipend > 5000;
"""

df_filter = pd.read_sql_query(query_filter, conn)
df_filter

   id   name         track  stipend
0   1  Aisha  Data Science     7000
1   3  Sneha  Data Science     6000
2   5  Meera  Data Science     8000

In [6]:
query_avg = """
SELECT track, AVG(stipend) AS average_stipend
FROM interns
GROUP BY track;
"""

df_avg = pd.read_sql_query(query_avg, conn)
df_avg

          track  average_stipend
0  Data Science           7000.0
1       Web Dev           4750.0

In [8]:
query_count = """
SELECT track, COUNT(*) AS total_interns
FROM interns
GROUP BY track;
"""

df_count = pd.read_sql_query(query_count, conn)
df_count

          track  total_interns
0  Data Science              3
1       Web Dev              2

In [9]:
conn.close()

In [10]:
import sqlite3
import pandas as pd

In [11]:
conn = sqlite3.connect("internship.db")
cursor = conn.cursor()

In [12]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS interns (
    id INTEGER PRIMARY KEY,
    name TEXT,
    track TEXT,
    stipend INTEGER
)
""")
conn.commit()

In [13]:
cursor.execute("DELETE FROM interns")  # optional: clears old data

intern_data = [
    (1, "Aisha", "Data Science", 15000),
    (2, "Rohan", "Web Dev", 12000),
    (3, "Megha", "AI", 18000),
    (4, "Kiran", "Cyber Security", 16000),
    (5, "Sara", "Data Science", 17000)
]

cursor.executemany("INSERT INTO interns VALUES (?, ?, ?, ?)", intern_data)
conn.commit()

In [14]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS mentors (
    mentor_id INTEGER PRIMARY KEY,
    mentor_name TEXT,
    track TEXT
)
""")
conn.commit()

In [15]:
cursor.execute("DELETE FROM mentors")  # optional

mentor_data = [
    (1, "Rahul", "Data Science"),
    (2, "Sneha", "Web Dev"),
    (3, "Arjun", "AI"),
    (4, "Meera", "Cyber Security")
]

cursor.executemany("INSERT INTO mentors VALUES (?, ?, ?)", mentor_data)
conn.commit()

In [16]:
query = """
SELECT interns.name, interns.track, mentors.mentor_name
FROM interns
INNER JOIN mentors
ON interns.track = mentors.track;
"""

df = pd.read_sql_query(query, conn)

df

    name           track mentor_name
0  Aisha    Data Science       Rahul
1  Rohan         Web Dev       Sneha
2  Megha              AI       Arjun
3  Kiran  Cyber Security       Meera
4   Sara    Data Science       Rahul

In [17]:
conn.close()